/*********************************
 * Themes, rules, and i18n support
 * Locale: Chinese; 中文
 *********************************/
;(function($) {
	/* Global configuration
	 */
	$.validator.config({
		//stopOnError: true,
		//focusCleanup: true,
		theme: 'yellow_top',
		timely: 2,

		// Custom rules
		rules: {
			digits: [/^\d+$/, "请填写数字"],
			letters: [/^[a-z]+$/i, "请填写字母"],
			date: [/^\d{4}-\d{2}-\d{2}$/, "请填写有效的日期，格式:yyyy-mm-dd"],
			time: [/^([01]\d|2[0-3])(:[0-5]\d){1,2}$/, "请填写有效的时间，00:00到23:59之间"],
			// email: [/^[\w\+\-]+(\.[\w\+\-]+)*@[a-z\d\-]+(\.[a-z\d\-]+)*\.([a-z]{2,4})$/i, "请填写有效的邮箱"],
			url: [/^(https?|s?ftp):\/\/\S+$/i, "请填写有效的网址"],
			qq: [/^[1-9]\d{4,}$/, "请填写有效的QQ号"],
			IDcard: [/(^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$)|(^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$)/, "请填写正确的身份证号码"],
			// mobile: [/^1[3-9]\d{9}$/, "请填写有效的手机号"],
			// zipcode: [/^\d{6}$/, "请检查邮政编码格式"],
			chinese: [/^[\u0391-\uFFE5]+$/, "请填写中文字符"],
			// username: [/^\w{3,12}$/, "请填写3-12位数字、字母、下划线"],
			password: [/^[\S]{6,16}$/, "请填写6-16位字符，不能包含空格"],

			mobile: [/^1((3[\d])|(4[5,6,7,9])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[\d])|(9[1,8,9]))\d{8}$/, '请填写有效的手机号'],
			mobile_full: [/^((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)$/, '请填写有效的电话号码'],
			tel:[/\d{3}-\d{8}|\d{4}-\d{7}/ ,'联系电话,如: 0936-4211236'],
			tax:[/\d{3}-\d{8}|\d{4}-\d{7}/ ,'传真号码,如: 0936-4211236'],
			chinese_name: [/^([\u4e00-\u9fa5·]{2,10})$/, '请填写中文姓名'],
			username_full: [/^(([a-zA-Z+\.?\·?a-zA-Z+]{2,30}$)|([\u4e00-\u9fa5+\·?\u4e00-\u9fa5+]{2,30}$))/, '请输入正确的姓名'],
			schar: [/^[\u4E00-\u9FA5\uf900-\ufa2d\w\.\s]+$/, '不能输入特殊字符'],
			datetime_12: [/^(1[0-2]|0?[1-9]):[0-5]\d$/, '12小时制时间(hh:mm)'],
			datetime_24: [/^((?:[01]\d|2[0-3]):[0-5]\d$)/, '24小时制时间(HH:mm)'],
			// date: [/^\d{4}(-)([0-1][0-2]|\d)\1([0-2]\d|\d|30|31)$/, '日期, 如: 2000-01-01或2000-1-1'],
			money: [/(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/, '数字/货币金额,如: 0.99、8.99、666'],
			card_no: [/^([1-9]{1})(\d{15}|\d{18})$/, '银行卡号(16或19位), 如: 6222026006705354217'],
			plate_no: [/^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9 挂学警港澳]{1})$/, '车牌号(新能源+非新能源), 如: 京A12345D、京A00599'],
			url: [/^((https?|ftp|file):\/\/)?([\da-z.-]+)\.([a-z.]{2,6})(\/\w\.-]*)*\/?/, 'URL链接(网址), 如: www.qq.com 、file:///C:/Users/work/pic.jpg'],
			email: [/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/, '请填写email地址, 如: 90203918@qq.com、mali@163.com'],
			id_cards: [/(^\d{8}(0\d|10|11|12)([0-2]\d|30|31)\d{3}$)|(^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$)/, '身份证号(15位/18位数字)'],
			account: [/^[a-zA-Z][a-zA-Z0-9_]{4,15}$/, '帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线组合, 如: justin、justin1989、justin_666'],
			decimals: [/^\d+\.\d+$/, '是否小数, 如: 0.0、0.09'],
			qq: [/^[1-9][0-9]{4,10}$/, '是否qq号格式正确'],
			number_letter: [/^[A-Za-z0-9]+$/, '是否由数字和字母组成'],
			number: [/^\d+$/, '只能输入整数'],
			age: [/^(?:[1-9][0-9]?|1[01][0-9]|120)$/, '请输入正确的年龄'],
			// password: [/^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/, '请填写，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符, 如: Kd@curry666'],
			username: [/^[a-zA-Z0-9_-]{2,16}$/, '请填写2到16位(字母，数字，下划线，减号), 如: xiaohua_qq'],
			weixin: [/^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/, '微信号，6至20位，以字母开头，字母，数字，减号，下划线'],    
			zipcode: [/^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\d{4}$/, '中国邮政编码, 如: 734500、100101'],
			month: [/^(0?[1-9]|1[0-2])$/, '月, 如: 02、12'],
			day: [/^((0?[1-9])|((1|2)[0-9])|30|31)$/, '天, 如: 01、09和1、31'],
			pl: [/(^[1-9]([0-9]+)?(\.[0-9]{1,})?$)|(^(0){1}$)|(^[0-9]\.[0-9]{1,}?$)/, '数字, 如: 1.6、123456.855、30'],
			f:  [/(^[1-9]([0-9]+)?(\.[0-9]{1,})?$)|(^(0){1}$)|(^[0-9]\.[0-9]{1,}?$)/, '数字, 如: 1.6、123456.855、30'],
			nf: [/(^[1-9]([0-9]+)?(\.[0-9]{1,})?$)|(^(0){1}$)|(^[0-9]\.[0-9]{1,}?$)/, '数字, 如: 1.6、123456.855、30'],
			hp: [/(^[1-9]([0-9]{1,3})?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/, '数字, 只能输入小数点前最多4位, 小数点后最多2位数字, 如: 1.6、1234.12、30'],
			fn: [/(^[1-9]([0-9]{1,3})?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/, '数字, 只能输入小数点前最多4位, 小数点后最多2位数字, 如: 1.6、1234.12、30'],

			accept: function (element, params) {
				if (!params) return true;
				var ext = params[0],
					value = $(element).val();
				return (ext === '*') ||
					(new RegExp(".(?:" + ext + ")$", "i")).test(value) ||
					this.renderMsg("只接受{1}后缀的文件", ext.replace(/\|/g, ','));
			}
		},

		// Default error messages
		messages: {
			0: "此处",
			fallback: "{0}格式不正确",
			loading: "正在验证...",
			error: "网络异常",
			timeout: "请求超时",
			required: "{0}不能为空",
			remote: "{0}已被使用",
			integer: {
				'*': "请填写整数",
				'+': "请填写正整数",
				'+0': "请填写正整数或0",
				'-': "请填写负整数",
				'-0': "请填写负整数或0"
			},
			match: {
				eq: "{0}与{1}不一致",
				neq: "{0}与{1}不能相同",
				lt: "{0}必须小于{1}",
				gt: "{0}必须大于{1}",
				lte: "{0}不能大于{1}",
				gte: "{0}不能小于{1}"
			},
			range: {
				rg: "请填写{1}到{2}的数",
				gte: "请填写不小于{1}的数",
				lte: "请填写最大{1}的数",
				gtlt: "请填写{1}到{2}之间的数",
				gt: "请填写大于{1}的数",
				lt: "请填写小于{1}的数"
			},
			checked: {
				q: '请选择',
				eq: "请选择{1}项",
				rg: "请选择{1}到{2}项",
				gte: "请至少选择{1}项",
				lte: "请最多选择{1}项"
			},
			length: {
				eq: "请填写{1}个字符",
				rg: "请填写{1}到{2}个字符",
				gte: "请至少填写{1}个字符",
				lte: "请最多填写{1}个字符",
				eq_2: "",
				rg_2: "",
				gte_2: "",
				lte_2: ""
			}
		}
	});

	/* Themes
	 */
	var TPL_ARROW = '<span class="n-arrow"><b>◆</b><i>◆</i></span>';
	$.validator.setTheme({
		'simple_right': {
			formClass: 'n-simple',
			msgClass: 'n-right'
		},
		'simple_bottom': {
			formClass: 'n-simple',
			msgClass: 'n-bottom'
		},
		'yellow_top': {
			formClass: 'n-yellow',
			msgClass: 'n-top',
			msgArrow: TPL_ARROW
		},
		'yellow_right': {
			formClass: 'n-yellow',
			msgClass: 'n-right',
			msgArrow: TPL_ARROW
		},
		'yellow_right_effect': {
			formClass: 'n-yellow',
			msgClass: 'n-right',
			msgArrow: TPL_ARROW,
			msgShow: function ($msgbox, type) {
				var $el = $msgbox.children();
				if ($el.is(':animated')) return;
				if (type === 'error') {
					$el.css({ left: '20px', opacity: 0 })
						.delay(100).show().stop()
						.animate({ left: '-4px', opacity: 1 }, 150)
						.animate({ left: '3px' }, 80)
						.animate({ left: 0 }, 80);
				} else {
					$el.css({ left: 0, opacity: 1 }).fadeIn(200);
				}
			},
			msgHide: function ($msgbox, type) {
				var $el = $msgbox.children();
				$el.stop().delay(100).show()
					.animate({ left: '20px', opacity: 0 }, 300, function () {
						$msgbox.hide();
					});
			}
		}
	});
})($);
